mozolin/matter-thread/apps/ha_matter_devices/esp-idf/sdkconfig.defaults

CONFIG_IDF_TARGET="esp32h2"

# Serial flasher config
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
#CONFIG_ESPTOOLPY_MONITOR_BAUD=460800

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y

# Wireless Coexistence
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=n

# OpenThread
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_RADIO=y
CONFIG_OPENTHREAD_DIAG=n
CONFIG_OPENTHREAD_COMMISSIONER=n
CONFIG_OPENTHREAD_JOINER=n
CONFIG_OPENTHREAD_BORDER_ROUTER=n
CONFIG_OPENTHREAD_CLI=n
CONFIG_OPENTHREAD_SRP_CLIENT=n
CONFIG_OPENTHREAD_DNS_CLIENT=n


# Deprecated options for backward compatibility
CONFIG_LOG_BOOTLOADER_LEVEL_ERROR=y
CONFIG_LOG_BOOTLOADER_LEVEL_INFO=n

# Configurations for optimizing the size of ot_rcp firmware
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
CONFIG_COMPILER_OPTIMIZATION_CHECKS_SILENT=y
CONFIG_COMPILER_SAVE_RESTORE_LIBCALLS=y
CONFIG_ESP_ERR_TO_NAME_LOOKUP=n
CONFIG_ESP_SYSTEM_PANIC_SILENT_REBOOT=y
CONFIG_LOG_DEFAULT_LEVEL_NONE=y
CONFIG_NEWLIB_NANO_FORMAT=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_OPENTHREAD_LOG_LEVEL_NONE=y

# ESP-Driver:USB Serial/JTAG Configuration
#CONFIG_USJ_ENABLE_USB_SERIAL_JTAG=y
#CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
#CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
#CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y

# Bootloder Log
#CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y
#CONFIG_BOOTLOADER_LOG_LEVEL=3

# Bootloder Log Format
#CONFIG_BOOTLOADER_LOG_COLORS=y
#CONFIG_BOOTLOADER_LOG_TIMESTAMP_SOURCE_CPU_TICKS=y

# Log Level
#CONFIG_LOG_DEFAULT_LEVEL_INFO=y
#CONFIG_LOG_DEFAULT_LEVEL=3
#CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
#CONFIG_LOG_MAXIMUM_LEVEL=5

# Log Format
#CONFIG_LOG_COLORS=y
#CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y

#CONFIG_MONITOR_BAUD=460800
